# java.util.List接口的方法subList()的使用注意事项
## 问题现象
用户注册接口注册时，传入10000个用户，只注册了一半的用户，从0~1000,2000~3000...。
## 问题定位

## 问题解决
经查看subList方法，对subList截取的列表进行修改的时候，会影响原来list的结构。

# 注册程序不跑的原因
## 问题现象
注冊程序跑一段时间后，不再注册新用户，程序也没停。

## 问题定位
其实应该用jstack查看线程状态。
最后用肉眼看代码，发现是锁的问题。


## 问题解决
加释放锁的逻辑代码。


# 程序不跑的原因
## 问题现象
webmanager运行了一段时间后，不产生日志。

## 问题定位
jstack查看线程状态。发现是数据库连接泄露问题。


## 问题解决
将关闭数据库连接的代码写在finally的模块里。



# 压测问题
## 问题现象
cmp压测的连接数上不去，cpu、内存都没到占用满状态。
用户收一段时间的消息后被踢下线。
推送1500万用户只有200w用户收到消息。

## 问题定位
。


## 问题解决
。


